app/controllers/therapies_controller.rb

SELECT "therapies".* FROM "therapies"
---
  def index
    @therapies = Therapy.all

SELECT  "therapies".* FROM "therapies" WHERE "therapies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @therapy = Therapy.find(params[:id])